In [1]:
import pandas as pd

In [2]:
#pandas data Type

In [3]:
# pandas Series
# pandas DataFrame

In [4]:
series_1 = pd.Series(['Orange','Apple','Mango'])

In [5]:
series_1

0    Orange
1     Apple
2     Mango
dtype: object

In [6]:
type(series_1)

pandas.core.series.Series

In [8]:
series_1.shape #1 dimensional

(3,)

In [11]:
price = pd.Series([2.2,5.3,3.1])

In [12]:
price

0    2.2
1    5.3
2    3.1
dtype: float64

In [13]:
price.shape

(3,)

In [9]:
############
#DATAFRAME
###########

In [10]:
#dataFrame(rows,columns)

In [14]:
#creating using dict
fruit_data = pd.DataFrame( {'Fruit Name':series_1,
                           'Price':price})

In [15]:
fruit_data

  Fruit Name  Price
0     Orange    2.2
1      Apple    5.3
2      Mango    3.1

In [17]:
fruit_data.shape # 2-dimensional

(3, 2)

In [18]:
###################### Importing data ########################

In [19]:
url = 'https://github.com/mrdbourke/zero-to-mastery-ml/blob/master/data/car-sales.csv'

In [23]:
car_data = pd.read_html(url)[0]

In [24]:
car_data

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0         NaN  Toyota  White         150043      4   $4,000.00
1         NaN   Honda    Red          87899      4   $5,000.00
2         NaN  Toyota   Blue          32549      3   $7,000.00
3         NaN     BMW  Black          11179      5  $22,000.00
4         NaN  Nissan  White         213095      4   $3,500.00
5         NaN  Toyota  Green          99213      4   $4,500.00
6         NaN   Honda   Blue          45698      4   $7,500.00
7         NaN   Honda   Blue          54738      4   $7,000.00
8         NaN  Toyota  White          60000      4   $6,250.00
9         NaN  Nissan  White          31600      4   $9,700.00

In [36]:
car_data.columns.values

array(['Unnamed: 0', 'Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'],
      dtype=object)

In [51]:
cars = car_data.iloc[:,1:]

In [52]:
cars

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [37]:
#cars(rows,columns) ( axis=0,axis=1)

In [38]:
#export dataFrame

In [53]:
cars.to_csv('car_sales.csv',index=False)

In [54]:
cars2 = pd.read_csv('car_sales.csv')

In [55]:
cars

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00